Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
	
	ПолноеИмяМетаданных = Метаданные().ПолноеИмя();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Проверить SID
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор строки (%1) не является идентификатором'"), Запись.sid),
			ПолноеИмяМетаданных);
			
		// Проверить SID документа
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_doc),
			СтрШаблон(НСтр("ru = 'Идентификатор документа (%1) не является идентификатором Simple'"), Запись.id_doc),
			ПолноеИмяМетаданных);
			
		// Проверить заполнение Настройка документа
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запись.НастройкаДокумента),
			НСтр("ru = 'Не определена настройка документа обмена'"),
			ПолноеИмяМетаданных);
		
		// Обновить значение Дата обновления
		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьМеткуВремени") Тогда
			Запись.ДатаОбновления = ДатаОбновленияЗаписи;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
